{
  "payload": {
    "ticket": {
      "metadata": {
        "product": "khoros_classic",
        "requester": {
          "id": 60507413,
          "uuid": "ded794a1-9fa8-5c97-ae4d-150efc109ed0",
          "full_name": "Jessica Dinsdale",
          "legacy_id": "003Uv000006ytOOIAY",
          "designation": null,
          "is_enabled": true,
          "is_mfa_enabled": false,
          "role": {
            "id": 4,
            "resource_type": "role"
          },
          "avatar": "https://central-supportdesk.kayako.com/avatar/get/ded794a1-9fa8-5c97-ae4d-150efc109ed0?1767759312",
          "agent_case_access": null,
          "organization_case_access": "REQUESTED",
          "organization": {
            "id": 60068602,
            "resource_type": "organization"
          },
          "teams": [],
          "emails": [
            {
              "id": 508944,
              "resource_type": "identity_email"
            }
          ],
          "phones": [],
          "twitter": [],
          "facebook": [],
          "external_identifiers": [],
          "custom_fields": [
            {
              "field": {
                "id": 1,
                "resource_type": "user_field"
              },
              "value": "",
              "resource_type": "user_field_value"
            },
            {
              "field": {
                "id": 2,
                "resource_type": "user_field"
              },
              "value": "",
              "resource_type": "user_field_value"
            }
          ],
          "pinned_notes_count": 0,
          "locale": {
            "id": 3,
            "resource_type": "locale"
          },
          "time_zone": null,
          "time_zone_offset": null,
          "greeting": null,
          "signature": null,
          "status_message": null,
          "last_seen_user_agent": "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/143.0.0.0 Safari/537.36 Edg/143.0.0.0",
          "last_seen_ip": "163.116.248.50",
          "last_seen_at": "2026-01-07T04:15:12+00:00",
          "last_active_at": "2026-01-07T04:15:12+00:00",
          "realtime_channel": "presence-9813ca639d37d1518f54b0c65e3b4bef061d5c9eb084715329b7324d129bf437@v1_users_60507413",
          "presence_channel": "user_presence-9813ca639d37d1518f54b0c65e3b4bef061d5c9eb084715329b7324d129bf437@4b9cfba31f85433821c4d95f6decb5f7ac9aba26",
          "password_updated_at": "2025-12-03T00:06:25+00:00",
          "avatar_updated_at": null,
          "last_logged_in_at": "2026-01-06T22:28:47+00:00",
          "last_activity_at": "2026-01-07T04:15:12+00:00",
          "created_at": "2025-07-08T18:43:26+00:00",
          "updated_at": "2026-01-07T04:15:12+00:00",
          "resource_type": "user",
          "resource_url": "https://central-supportdesk.kayako.com/api/v1/users/60507413"
        },
        "ticket_idt": 60149875
      },
      "interactions": [
        [
          "2025-08-07T18:45:23+00:00",
          "Kayako - ticket id 60149875 // ATLAS commented publicly: Dear Jessica,\n\nThank you for your follow-up regarding the persistent issue with the “Role does not equal” filter in Community Analytics for the Emerging Leaders Forum. We understand the urgency and appreciate the detailed information, screenshots, and CSV exports you have provided.\n\nSummary of Observations:\nYour testing confirms that when you apply the filter Role equals (Administrator, Moderator, LPL Home Office), only those users appear as expected. However, when you apply the filter Role does not equal (Administrator, Moderator, LPL Home Office), those same users are still included in the results for the Emerging Leaders Forum, which is not the intended behavior. This issue appears isolated to this specific forum, as clearing the browser cache resolved similar issues for other communities.\n\nRelevant Product Behavior and Limitations:\nBased on the official documentation (Apply filters to Community Analytics reports [https://khoros-classic.kayako.com/article/125911] and Tips on using advanced filters for Community Analytics [https://khoros-classic.kayako.com/article/125912]), the Role filter is designed to include or exclude users based on their assigned roles. However, there are known limitations when users have multiple roles assigned: the filter may not fully exclude users who match any of the specified roles if they also have additional roles. This is consistent with the behavior you are experiencing.\n\nAdditional points from the documentation:\n\n \t* Filter rules are case sensitive. Ensure that role names are entered exactly as they appear in your role list.\n \t* You can enter multiple values in each rule as a comma-separated list (no spaces after the comma).\n \t* When users have overlapping or multiple roles, the “does not equal” filter may not exclude them as intended.\n\nRecommended Workaround:\nAs a reliable workaround, you can export the full member data for the Emerging Leaders Forum and apply additional filtering in Excel or another analytics tool to exclude users with the specified roles. The export includes a Role column, which allows you to filter out users with Admin, Moderator, or LPL Home Office roles manually.\n\nFor step-by-step instructions on applying filters and exporting member data, please refer to the following articles:\n\n \t* Apply filters to Community Analytics reports [https://khoros-classic.kayako.com/article/125911]\n \t* Tips on using advanced filters for Community Analytics [https://khoros-classic.kayako.com/article/125912]\n \t* Analytics Filters and Exporting Reports [https://khoros-classic.kayako.com/article/125006]\n\nSummary:\nThe behavior you are experiencing is a known limitation of the Community Analytics filtering logic when users have multiple roles assigned. While the Role equals filter works as expected, the Role does not equal filter may not fully exclude users with overlapping roles. Exporting the data and applying additional filtering externally is currently the most reliable solution.\n\nIf you have any further questions about filter configuration, analytics reporting, or need clarification on the export process, please let us know. We are here to assist you as you continue your analysis.\n\nSincerely,\nAtlas\nKhoros Community Classic Support Team.\n\n-------------------------\n\nThis response contains information generated with 3rd party components for which we disclaim all responsibility. For more details, you can check the terms and conditions at: chattbotterms.trilogy.com [https://chatbotterms.trilogy.com]\n\nThis ticket will stay open for one week unless you reply with \"This ticket can be closed\" or update the status to Closed in the portal. We will write to you again to remind you."
        ],
        [
          "2025-08-07T18:44:40+00:00",
          "Kayako - ticket id 60149875 // Jessica Dinsdale commented publicly:  \n\nHello, \n\n \n\nI have not received a response on the following after reaching out last week Can you please provide a response on next steps to resolve? We are eager to resolve since this request has now been open for over a month without resolution. \n\n \n\nJessica Dinsdale\n\nAssistant Vice President | LPL Client Communities | Client Insights and Experience\n\nDigital Product Manager – LPL Community Hub\n\nLPL Financial\n\nPhone: 858-909-7991 \n\n \n\n-------------------------\n\nThe information contained in this email message is being transmitted to and is intended for the use of only the individual(s) to whom it is addressed. If the reader of this message is not the intended recipient, you are hereby advised that any dissemination, distribution or copying of this message is strictly prohibited. If you have received this message in error, please immediately delete.\n\nMember FINRA [http://www.Finra.org] / SIPC [http://www.Sipc.org]\nCopyright 2017 – LPL Financial. All Rights Reserved. \n"
        ],
        [
          "2025-07-31T23:19:26+00:00",
          "Kayako - ticket id 60149875 // ATLAS commented publicly: Dear Jessica,\n\nThank you for your detailed update and for providing both screenshots and CSV exports regarding the filtering issue in the Emerging Leaders Forum within Community Analytics. Based on your description and the attached files, it is clear that the “Role does not equal” filter is not excluding users with the specified roles (Administrator, Moderator, LPL Home Office) as expected, even though the “Role equals” filter works correctly for the same roles.\n\nKey Observations:\n\n \t* Your screenshots and exports confirm that when you set the filter to Role equals Admin, Moderator, and LPL Home Office, only those users appear, which is correct.\n \t* However, when you set the filter to Role does not equal Admin, Moderator, and LPL Home Office, those same users are still included in the results, which is not the intended behavior.\n \t* This issue appears to be isolated to the Emerging Leaders Forum, as clearing the browser cache resolved similar issues for other communities.\n\nRelevant Product Behavior and Limitations:\n\n \t* According to the articles Apply filters to Community Analytics reports [https://khoros-classic.kayako.com/article/125911] and Tips on using advanced filters for Community Analytics [https://khoros-classic.kayako.com/article/125912], the Role filter is designed to include or exclude users based on their assigned roles. However, there are known limitations when users have multiple roles assigned—the filter may not fully exclude users who match any of the specified roles if they also have additional roles.\n \t* Filter rules are case sensitive, and values must be entered exactly as they appear in your role list. If there are any discrepancies in role naming or assignment, this can affect filter results.\n \t* For more granular filtering, you can enter multiple values in each rule as a comma-separated list (no spaces after the comma), as you have done.\n\nRecommended Steps and Workarounds:\n\n \t* Review Role Assignments: Double-check the role assignments for the users appearing incorrectly in the filtered results. If these users have multiple roles (including one of the excluded roles and another role), the filter may not exclude them as intended due to product limitations.\n \t* Export and Post-Process: As a workaround, you can export the full member data for the Emerging Leaders Forum and apply additional filtering in Excel or another analytics tool to exclude users with the specified roles. The export includes a Role column, which allows you to filter out users with Admin, Moderator, or LPL Home Office roles manually.\n\n\t* Reference Articles: For step-by-step instructions on applying filters and exporting member data, please see: \n\n \t* Apply filters to Community Analytics reports [https://khoros-classic.kayako.com/article/125911]\n \t* Tips on using advanced filters for Community Analytics [https://khoros-classic.kayako.com/article/125912]\n \t* View and download community member metrics [https://khoros-classic.kayako.com/article/125934]\n\nSummary:\n\nThe behavior you are experiencing is consistent with a known limitation in Community Analytics filtering when users have multiple roles assigned. While the Role equals filter works as expected, the Role does not equal filter may not fully exclude users with overlapping roles. The most reliable workaround is to export the data and apply additional filtering externally.\n\nIf you have any further questions about filter configuration or need clarification on the export process, please let us know. We are here to assist you as you continue your analysis.\n\nSincerely,\nAtlas\nKhoros Community Classic Support Team.\n\n-------------------------\n\nThis response contains information generated with 3rd party components for which we disclaim all responsibility. For more details, you can check the terms and conditions at: chattbotterms.trilogy.com [https://chatbotterms.trilogy.com]\n\nThis ticket will stay open for one week unless you reply with \"This ticket can be closed\" or update the status to Closed in the portal. We will write to you again to remind you."
        ],
        [
          "2025-07-31T23:18:28+00:00",
          "Kayako - ticket id 60149875 // Jessica Dinsdale commented publicly:  \n\nHello, \n\n \n\nI would like to reopen this ticket. I am still having trouble with the Emerging Leaders Forum when attempting to exclude (not equal) certain roles (i.e. Administrator, Moderator, LPL Home Office). I attempted all the solutions recommended in the previous email, and while clearing browsing cache worked for the other communities (Atria, LPL Innovators), none of these worked for the Emerging Leaders. As shown below, when I apply the filter to equal Admin, Moderator, and LPL Home Office, the individuals under these roles only appear as intended. However, when I apply the filter to not equal Admin, Moderator, and LPL Home Office, they also appear in this report which is not the intended result. I’ve also attached the exports. \n\n \n\nCan we please have someone investigate this urgently? Happy to get on a call to walk through if needed. \n\n \n\nEmerging Leaders Forum – Role = Administrator, LPL Home Office, Moderator – Includes the correct individuals as expected who hold these roles\n\n \n\nimage\n\n \n\n \n\n \n\nEmerging Leaders Forum – Role does not equal Administrator, LPL Home Office, Moderator – Still includes these individuals \n\n \n\nimage\n\n \n\n \n\n \n\nJessica Dinsdale\n\nAssistant Vice President | LPL Client Communities | Client Insights and Experience\n\nDigital Product Manager – LPL Community Hub\n\nLPL Financial\n\nPhone: 858-909-7991 \n\n \n\n-------------------------\n\nThe information contained in this email message is being transmitted to and is intended for the use of only the individual(s) to whom it is addressed. If the reader of this message is not the intended recipient, you are hereby advised that any dissemination, distribution or copying of this message is strictly prohibited. If you have received this message in error, please immediately delete.\n\nMember FINRA [http://www.Finra.org] / SIPC [http://www.Sipc.org]\nCopyright 2017 – LPL Financial. All Rights Reserved. \n"
        ],
        [
          "2025-07-23T21:37:17+00:00",
          "Kayako - ticket id 60149875 // ATLAS commented publicly: Dear Jessica,\n\nThank you for your update and for letting us know that you are still reviewing the information regarding the Community Analytics Reporting filters.\n\nTo summarize, when applying multiple Role, not equals filters in Community Analytics, users with those roles (such as Admin, LPL Home Office, and Moderator) may still appear in the results if they have multiple roles assigned or if there are overlapping role assignments. This is a known limitation of the filtering logic in Community Analytics.\n\nFor your reference, here are some best practices and resources to help you achieve more accurate filtering:\n\n \t* Filter Logic: When using several not equals filters for the same field, the system is designed to exclude users matching any of the specified roles. However, if a user has multiple roles, they may not be fully excluded. Reviewing user role assignments in your user management section can help clarify if overlapping roles are affecting your results.\n \t* Advanced Filtering: For more complex scenarios, consider using a combination of equals and not equals filters, or grouping filters where possible. The article Tips on using advanced filters for Community Analytics [https://community.khoros.com/t5/Community-Analytics/Tips-on-using-advanced-filters-for-Community-Analytics/ta-p/625912] provides additional strategies for refining your reports.\n \t* Exporting and Reviewing Data: If the exported CSV data still includes users with excluded roles, ensure that the filter criteria are correctly set before export. Sometimes, refreshing the report or clearing your browser cache can help apply the latest filter settings.\n \t* Known Limitations and Workarounds: If users with excluded roles continue to appear due to multi-role assignments, you may need to export the full data set and apply additional filtering in Excel or another analytics tool as a temporary workaround.\n\n\t* Step-by-Step Guidance: For detailed instructions on applying filters and downloading member metrics, please refer to the following articles: \n\n \t* Apply filters to Community Analytics reports [https://community.khoros.com/t5/Community-Analytics/Apply-filters-to-Community-Analytics-reports/ta-p/625911]\n \t* View and download community member metrics [https://community.khoros.com/t5/Community-Analytics/View-and-download-community-member-metrics/ta-p/625934]\n\nIf you have any further questions or need clarification on filter setup or analytics reporting, please let us know. We are here to assist you as you continue your review.\n\nSincerely,\nAtlas\nKhoros Community Classic Support Team.\n\n-------------------------\n\nThis response contains information generated with 3rd party components for which we disclaim all responsibility. For more details, you can check the terms and conditions at: chattbotterms.trilogy.com [https://chatbotterms.trilogy.com]\n\nThis ticket will stay open for one week unless you reply with \"This ticket can be closed\" or update the status to Closed in the portal. We will write to you again to remind you."
        ],
        [
          "2025-07-23T21:36:40+00:00",
          "Kayako - ticket id 60149875 // Jessica Dinsdale commented publicly:  \n\nHello, \n\n \n\nPlease keep ticket open as I am still reviewing. \n\n \n\nJessica Dinsdale\n\nAssistant Vice President | LPL Client Communities | Client Insights and Experience\n\nDigital Product Manager – LPL Community Hub\n\nLPL Financial\n\nPhone: 858-909-7991 \n\n \n\n-------------------------\n\nThe information contained in this email message is being transmitted to and is intended for the use of only the individual(s) to whom it is addressed. If the reader of this message is not the intended recipient, you are hereby advised that any dissemination, distribution or copying of this message is strictly prohibited. If you have received this message in error, please immediately delete.\n\nMember FINRA [http://www.Finra.org] / SIPC [http://www.Sipc.org]\nCopyright 2017 – LPL Financial. All Rights Reserved. \n"
        ],
        [
          "2025-07-22T21:10:52+00:00",
          "Kayako - ticket id 60149875 // ATLAS commented publicly: Dear Jessica,\n\nThank you for your prompt response and for providing the requested details regarding the issue with filters not working as expected in Community Analytics Reporting.\n\nBased on your description, it appears that when applying multiple \"Role, not equals\" filters in the Community Analytics reports, users with those roles (such as Admin, LPL Home Office, and Moderator) are still appearing in the results, particularly under the Members tab for the specified boards. This is not the expected behavior, as the filters should exclude those roles from the report output.\n\nRecommended Steps and Considerations:\n\n1. Review Filter Logic:\nWhen using multiple \"not equals\" filters for the same field (e.g., Role), the filter logic in Community Analytics is designed to exclude users who match any of the specified roles. However, if a user has multiple roles assigned, or if there are custom role hierarchies, the filter may not behave as intended. Please ensure that each user has only one of the roles being filtered, or consider using a combination of \"equals\" and \"not equals\" filters for more precise results.\n\n2. Advanced Filtering Tips:\nRefer to our article Apply filters to Community Analytics reports [https://community.khoros.com/t5/Community-Analytics/Apply-filters-to-Community-Analytics-reports/ta-p/625911] for guidance on setting up filters. For more complex scenarios, the article Tips on using advanced filters for Community Analytics [https://community.khoros.com/t5/Community-Analytics/Tips-on-using-advanced-filters-for-Community-Analytics/ta-p/625912] provides additional strategies, such as grouping filters or using \"OR\" and \"AND\" logic where available.\n\n3. Exported Data Review:\nIf the exported CSV data still includes users with excluded roles, double-check the filter criteria before export. Sometimes, the UI may display cached results; refreshing the report or clearing browser cache can help ensure the latest filter settings are applied.\n\n4. Known Limitations:\nThere are known limitations when filtering by roles if users have overlapping or multiple roles. In such cases, the filter may not exclude all intended users. As a workaround, you may need to adjust your role assignments or use additional filters (such as filtering by specific board names or user attributes) to refine your results.\n\n5. Viewing and Downloading Metrics:\nFor step-by-step instructions on viewing and downloading member metrics, please see View and download community member metrics [https://community.khoros.com/t5/Community-Analytics/View-and-download-community-member-metrics/ta-p/625934].\n\nExample:\nIf you wish to exclude users with roles Admin, LPL Home Office, and Moderator, ensure your filters are set as follows:\n\n \t* Role not equals Admin\n \t* Role not equals LPL Home Office\n \t* Role not equals Moderator\n\n If users still appear, verify their role assignments in the user management section to confirm they do not have additional roles that may affect filter logic.\n\nIf after reviewing these steps the issue persists, it may be due to a product limitation regarding multi-role filtering. In such cases, consider exporting the full data set and applying additional filtering in Excel or another analytics tool as a temporary workaround.\n\nFor further details on filter configuration and best practices, please refer to the articles linked above.\n\nWe hope this guidance helps you achieve the desired reporting outcome. If you have any additional questions or require clarification on the filter setup, please let us know.\n\nSincerely,\nAtlas\nKhoros Community Classic Support Team.\n\n-------------------------\n\nThis response contains information generated with 3rd party components for which we disclaim all responsibility. For more details, you can check the terms and conditions at: chattbotterms.trilogy.com [https://chatbotterms.trilogy.com]\n\nThis ticket will stay open for one week unless you reply with \"This ticket can be closed\" or update the status to Closed in the portal. We will write to you again to remind you."
        ],
        [
          "2025-07-22T21:10:10+00:00",
          "Kayako - ticket id 60149875 // Jessica Dinsdale commented publicly:  \n\nHello,\n\n \n\nPlease see responses below in red. \n\n \n\nJessica Dinsdale\n\nAssistant Vice President | LPL Client Communities | Client Insights and Experience\n\nDigital Product Manager – LPL Community Hub\n\nLPL Financial\n\nPhone: 858-909-7991 \n\n \n\n \n"
        ],
        [
          "2025-07-22T20:50:05+00:00",
          "Kayako - ticket id 60149875 // ATLAS commented publicly: Dear Jessica Dinsdale,\n\nThank you for your continued patience and for bringing this matter to our attention. We understand the urgency of resolving the issue with filters not working as expected in Community Analytics Reporting, and we apologize for the delay in our response.\n\nTo expedite our investigation and ensure we address your concerns accurately, we kindly request the following additional information:\n\n- A description of the specific data mismatch or export issue you are experiencing.\n- A screenshot or copy of the reported metric(s) as displayed in the Community UI.\n- A screenshot or sample of the exported data (for example, a CSV file) that demonstrates the discrepancy.\n- Clarification on whether this is a user-specific issue, or if it is related to access or permissions.\n- The exact steps to reproduce the issue, if it is not related to permissions or access.\n- Confirmation on whether this functionality was working as expected previously, and if so, when the issue was first observed.\n- If you are referencing any documents from Atlas regarding analytics, please share those as well.\n\nProviding these details will help us diagnose the problem more efficiently and work towards a resolution.\n\nIf you require additional time to gather this information, please note that we will keep this ticket open for one additional week to accommodate your response.\n\nSincerely, \nATLAS \nKhoros Community Classic Support Team\n\nThis ticket will stay open for one week unless you reply with \"This ticket can be closed\" or update the status to Closed in the portal. We will write to you again to remind you."
        ],
        [
          "2025-07-22T20:49:59+00:00",
          "Kayako - ticket id 60149875 // ATLAS commented privately: Requesting more information"
        ],
        [
          "2025-07-22T20:49:37+00:00",
          "Kayako - ticket id 60149875 // Jessica Dinsdale commented publicly:  \n\nAndrew & Jasmin, \n\n \n\nCan we please receive a response on the following ASAP? This has now been open for 18 days without resolution and Community Managers are unable to conduct metric analysis. Happy to join a call to discuss if needed. \n\n \n\nJessica Dinsdale\n\nAssistant Vice President | LPL Client Communities | Client Insights and Experience\n\nDigital Product Manager – LPL Community Hub\n\nLPL Financial\n\nPhone: 858-909-7991 \n\n \n\nFrom: Andrew Mugisha <andrew.mugisha@ignitetech.com> \nSent: Wednesday, July 16, 2025 11:13 PM\nTo: Khoros Support <support@khoros.com>; Jessica Dinsdale <Jessica.Dinsdale@lplfinancial.com>\nCc: Madison Reina <Madison.Reina@lplfinancial.com>\nSubject: RE: Khoros Support Case Filters Not Working as Expected in Community Analytics Reporting, 00448892 - [ ref:_00D2E12dgH._500UvMJTTC:ref ]\n\n \n\nHi Support team, This issue has been outstanding for 12 days without any response (Case #00448892). Can we please have an update on the current status and expected resolution timeline? Best regards, Andrew Mugisha | AI Innovation Specialist\n\nHi Support team,\n\n \n\nThis issue has been outstanding for 12 days without any response (Case #00448892).\n\n \n\nCan we please have an update on the current status and expected resolution timeline?\n\n \n\nBest regards,\n\nimage\n\n \n\nAndrew Mugisha  |  AI Innovation Specialist - Sales\n\n \n\nClick here to book a meeting [https://urldefense.com/v3/__https:/cal.read.ai/andrew-mugisha/15-min__;!!Cz2fjcuE!hjRxW-7YPWr9tX3mbxBN-N7-sjnvENIURIMfVdr9_1kXY-3ktz_0NCQTj3-osIWWnWsCSHnd7XpP4R3lf1_ywslY6z7oMgeCJRUi2Q$]\n\n+256785277748\n\nignitetech.ai [https://urldefense.com/v3/__http:/ignitetech.ai__;!!Cz2fjcuE!hjRxW-7YPWr9tX3mbxBN-N7-sjnvENIURIMfVdr9_1kXY-3ktz_0NCQTj3-osIWWnWsCSHnd7XpP4R3lf1_ywslY6z7oMgfj3CJmLQ$]  |  image [https://urldefense.com/v3/__https:/x.com/andrew_mug40178/photo__;!!Cz2fjcuE!hjRxW-7YPWr9tX3mbxBN-N7-sjnvENIURIMfVdr9_1kXY-3ktz_0NCQTj3-osIWWnWsCSHnd7XpP4R3lf1_ywslY6z7oMgdiYeqmVQ$]  https://x.com/andrew_mug40178/photo [https://urldefense.com/v3/__https:/x.com/andrew_mug40178/photo__;!!Cz2fjcuE!hjRxW-7YPWr9tX3mbxBN-N7-sjnvENIURIMfVdr9_1kXY-3ktz_0NCQTj3-osIWWnWsCSHnd7XpP4R3lf1_ywslY6z7oMgdiYeqmVQ$]   image [https://urldefense.com/v3/__https:/www.linkedin.com/in/andrew-mugisha/__;!!Cz2fjcuE!hjRxW-7YPWr9tX3mbxBN-N7-sjnvENIURIMfVdr9_1kXY-3ktz_0NCQTj3-osIWWnWsCSHnd7XpP4R3lf1_ywslY6z7oMgdolPiIDg$] LinkedIn [https://urldefense.com/v3/__https:/www.linkedin.com/in/andrew-mugisha/__;!!Cz2fjcuE!hjRxW-7YPWr9tX3mbxBN-N7-sjnvENIURIMfVdr9_1kXY-3ktz_0NCQTj3-osIWWnWsCSHnd7XpP4R3lf1_ywslY6z7oMgdolPiIDg$]\n\n \n\n image [https://urldefense.com/v3/__http:/www.gfi.ai__;!!Cz2fjcuE!hjRxW-7YPWr9tX3mbxBN-N7-sjnvENIURIMfVdr9_1kXY-3ktz_0NCQTj3-osIWWnWsCSHnd7XpP4R3lf1_ywslY6z7oMgct9v7iFg$]\n\n \n\n     \n\n \n\nOn Wed Jul 16, 2025, 06:12 PM GMT, Jessica Dinsdale wrote:\n\n> Hi Jasmin, \n> \n>  \n> \n> Any updates on below? Can we escalate this request since we are now behind on sending CMs this reporting? \n> \n>  \n> \n> Jessica Dinsdale\n> \n> Assistant Vice President | LPL Client Communities | Client Insights and Experience\n> \n> Digital Product Manager – LPL Community Hub\n> \n> LPL Financial\n> \n> Phone: 858-909-7991 \n> \n>  \n> \n> From: Jessica Dinsdale \n> Sent: Friday, July 11, 2025 9:58 AM\n> To: Khoros Support <support@khoros.com>\n> Cc: andrew.mugisha@ignitetech.com; arun.nair@khoros.com; Madison Reina <madison.reina@lplfinancial.com>\n> Subject: RE: Khoros Support Case Filters Not Working as Expected in Community Analytics Reporting, 00448892 - [ ref:_00D2E12dgH._500UvMJTTC:ref ]\n> \n>  \n> \n> Hi Jasmin, \n> \n>  \n> \n> I’m following up on below to see if any resolution on this item. Let me know if you need any details from my end to resolve/investigate. \n> \n>  \n> \n> Jessica Dinsdale\n> \n> Assistant Vice President | LPL Client Communities | Client Insights and Experience\n> \n> Digital Product Manager – LPL Community Hub\n> \n> LPL Financial\n> \n> Phone: 858-909-7991 \n> \n>  \n> \n> From: Khoros Support <support@khoros.com> \n> Sent: Wednesday, July 2, 2025 12:58 AM\n> To: Jessica Dinsdale <Jessica.Dinsdale@lplfinancial.com>\n> Cc: andrew.mugisha@ignitetech.com; arun.nair@khoros.com; Madison Reina <Madison.Reina@lplfinancial.com>\n> Subject: Khoros Support Case Filters Not Working as Expected in Community Analytics Reporting, 00448892 - [ ref:_00D2E12dgH._500UvMJTTC:ref ]\n> \n>  \n> \n> [img src=\"https://khoros--c.documentforce.com/servlet/servlet.ImageServer?id=0152E000002tqhN&oid=00D2E0000012dgH\"] [https://urldefense.com/v3/__https:/community.khoros.com/t5/crmsupport/casepage/issue-id/00448892/issue-guid/500Uv00000MJTTC/issue-provider/salesforce__;!!Cz2fjcuE!gG_jpUv4nJMjdWJLOE-0JIHrR4yBq2ATIURuWHv4CwQBRsDDYV8YiGjXq9_30HyDsWK1dZCtNq9Z0M8O-h1yE9GXpg$]\n> \n> Hi Jessica, \n> \n>  \n> \n> Greetings!!\n> \n>  \n> \n> Thank you for reaching out to the Khoros Technical Support team, We have acknowledged your request, and we are checking on this. We will let you know once we have an update to share.\n> \n> Regards\n> \n> Jasmin Tripathy\n> \n>  \n> \n> Khoros Technical Support\n> \n>  \n> \n> Here are the last few case updates:\n> \n>  \n> \n> --------------------------------------------------------------- \n> On Tue, Jul 01, 2025 at 4:37 PM PDT, Integrations wrote: \n> \n> Hello Jessica,\n> \n> Thank you for reaching out to Khoros Customer Support. Based on your recent request we have created the case 00448892. Please keep this case number handy as we will be communicating all the updates through this case until it is resolved.\n> \n> This is what you can expect going forward:\n> - The case will be reviewed and assigned to the appropriate product support team.\n> - A team member will be in touch with you shortly during standard business hours.\n> - You can find out about how support operates including business hours via our support contact page. (https://community.khoros.com/t5/Contact-Khoros-Support/bd-p/contact-support [https://urldefense.com/v3/__https:/community.khoros.com/t5/Contact-Khoros-Support/bd-p/contact-support__;!!Cz2fjcuE!gG_jpUv4nJMjdWJLOE-0JIHrR4yBq2ATIURuWHv4CwQBRsDDYV8YiGjXq9_30HyDsWK1dZCtNq9Z0M8O-h3qInEHqQ$])\n> \n> NOTE: If you feel this issue qualifies as a Severity 1 incident, please contact us at outage@khoros.com for immediate attention.\n> \n> Thank you again for reaching out to Khoros Support, we will be in touch soon.\n> \n> For your reference, here is the basic information in this case: \n> Case Subject: Filters Not Working as Expected in Community Analytics Reporting\n> Case Description: \n> When looking to pull reports from the Community Analytics section in the tool and applying filters. The filters do not seem to be operating as expected. Specifically, under community dashboard, I select Community Analytics, select Content from the left navigation panel, followed by forums. We then alter our date range to Year to Date and select the pencil icon to build filters. We create a total of 4 filters: 1) Role, not equals, Admin, 2) Role, not equals, LPL Home Office, 3) Role, not equals, Moderator, 4) Board name, equals, Emerging Leaders Forum or Atria Acclimation Forum or LPL Innovators Forum. Goal for pulling this report is to be able to see the page views, threads, and members analytics within the Conversations & Members tabs. However, when looking at the Members' tab under top 50, it includes individuals who have been assigned the roles (Admin, LPL Home Office, Moderator) that we applied the filter not to include. For example, for Emerging Leaders, ryan.mcclain, trayce.brown1, charles.bennington who are all Moderators are still appearing in the dashboard for top 50 under the member's tab\n> \n>  \n> \n> You can reply to this case via the case portal [https://urldefense.com/v3/__https:/community.khoros.com/t5/crmsupport/casepage/issue-id/00448892/issue-guid/500Uv00000MJTTC/issue-provider/salesforce__;!!Cz2fjcuE!gG_jpUv4nJMjdWJLOE-0JIHrR4yBq2ATIURuWHv4CwQBRsDDYV8YiGjXq9_30HyDsWK1dZCtNq9Z0M8O-h1yE9GXpg$] or via email at any time to provide us with more information, report an update on your situation, or include additional information that will help us narrow down the problem.\n> \n>  \n> \n> Head over to our community Atlas [https://urldefense.com/v3/__https:/community.khoros.com__;!!Cz2fjcuE!gG_jpUv4nJMjdWJLOE-0JIHrR4yBq2ATIURuWHv4CwQBRsDDYV8YiGjXq9_30HyDsWK1dZCtNq9Z0M8O-h06-2JMyg$], where you can meet your support team [https://urldefense.com/v3/__https:/community.khoros.com/t5/Meet-The-Support-Team/bd-p/SupportViewAll__;!!Cz2fjcuE!gG_jpUv4nJMjdWJLOE-0JIHrR4yBq2ATIURuWHv4CwQBRsDDYV8YiGjXq9_30HyDsWK1dZCtNq9Z0M8O-h1bGFSSNA$] and find out more about the agents looking after your cases, join the conversation or search for answers to your questions.\n> \n>  \n> \n> [ ref:_00D2E12dgH._500UvMJTTC:ref ]\n> \n>  \n> \n>  \n> \n> -------------------------\n> \n> The information contained in this email message is being transmitted to and is intended for the use of only the individual(s) to whom it is addressed. If the reader of this message is not the intended recipient, you are hereby advised that any dissemination, distribution or copying of this message is strictly prohibited. If you have received this message in error, please immediately delete.\n> \n> Member FINRA [https://urldefense.com/v3/__http:/www.Finra.org__;!!Cz2fjcuE!hjRxW-7YPWr9tX3mbxBN-N7-sjnvENIURIMfVdr9_1kXY-3ktz_0NCQTj3-osIWWnWsCSHnd7XpP4R3lf1_ywslY6z7oMgevv9RnPw$] / SIPC [https://urldefense.com/v3/__http:/www.Sipc.org__;!!Cz2fjcuE!hjRxW-7YPWr9tX3mbxBN-N7-sjnvENIURIMfVdr9_1kXY-3ktz_0NCQTj3-osIWWnWsCSHnd7XpP4R3lf1_ywslY6z7oMgeOrg-viw$]\n> Copyright 2017 – LPL Financial. All Rights Reserved.\n "
        ]
      ],
      "diagnostics": {
        "kayako": {
          "requester_ok": true,
          "ticket_ok": true,
          "ticket_has_custom_fields": true,
          "ticket_translog_items": 11,
          "side_conversation_items": 0
        },
        "jira": {
          "link_present": false,
          "link_value": ""
        },
        "github": {
          "link_present": false,
          "link_value": ""
        }
      }
    },
    "similar_tickets": []
  }
}